espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG24/Include/efr32mg24_mvp.h
/* Bit fields for MVP EN */
#define _MVP_EN_RESETVALUE                              0x00000000UL                     /**< Default value for MVP_EN                    */
#define _MVP_EN_MASK                                    0x00000003UL                     /**< Mask for MVP_EN                             */
#define MVP_EN_EN                                       (0x1UL << 0)                     /**< Enable                                      */
#define _MVP_EN_EN_SHIFT                                0                                /**< Shift value for MVP_EN                      */
#define _MVP_EN_EN_MASK                                 0x1UL                            /**< Bit mask for MVP_EN                         */
#define _MVP_EN_EN_DEFAULT                              0x00000000UL                     /**< Mode DEFAULT for MVP_EN                     */
#define MVP_EN_EN_DEFAULT                               (_MVP_EN_EN_DEFAULT << 0)        /**< Shifted mode DEFAULT for MVP_EN             */
#define MVP_EN_DISABLING                                (0x1UL << 1)                     /**< Disablement Busy Status                     */
#define _MVP_EN_DISABLING_SHIFT                         1                                /**< Shift value for MVP_DISABLING               */
#define _MVP_EN_DISABLING_MASK                          0x2UL                            /**< Bit mask for MVP_DISABLING                  */
#define _MVP_EN_DISABLING_DEFAULT                       0x00000000UL                     /**< Mode DEFAULT for MVP_EN                     */
#define MVP_EN_DISABLING_DEFAULT                        (_MVP_EN_DISABLING_DEFAULT << 1) /**< Shifted mode DEFAULT for MVP_EN             */

/* Bit fields for MVP SWRST */
#define _MVP_SWRST_RESETVALUE                           0x00000000UL                        /**< Default value for MVP_SWRST                 */
#define _MVP_SWRST_MASK                                 0x00000003UL                        /**< Mask for MVP_SWRST                          */
#define MVP_SWRST_SWRST                                 (0x1UL << 0)                        /**< Software Reset Command                      */
#define _MVP_SWRST_SWRST_SHIFT                          0                                   /**< Shift value for MVP_SWRST                   */
#define _MVP_SWRST_SWRST_MASK                           0x1UL                               /**< Bit mask for MVP_SWRST                      */
#define _MVP_SWRST_SWRST_DEFAULT                        0x00000000UL                        /**< Mode DEFAULT for MVP_SWRST                  */
#define MVP_SWRST_SWRST_DEFAULT                         (_MVP_SWRST_SWRST_DEFAULT << 0)     /**< Shifted mode DEFAULT for MVP_SWRST          */
#define MVP_SWRST_RESETTING                             (0x1UL << 1)                        /**< Software Reset Busy Status                  */
#define _MVP_SWRST_RESETTING_SHIFT                      1                                   /**< Shift value for MVP_RESETTING               */
#define _MVP_SWRST_RESETTING_MASK                       0x2UL                               /**< Bit mask for MVP_RESETTING                  */
#define _MVP_SWRST_RESETTING_DEFAULT                    0x00000000UL                        /**< Mode DEFAULT for MVP_SWRST                  */
#define MVP_SWRST_RESETTING_DEFAULT                     (_MVP_SWRST_RESETTING_DEFAULT << 1) /**< Shifted mode DEFAULT for MVP_SWRST          */

/* Bit fields for MVP CFG */
#define _MVP_CFG_RESETVALUE                             0x00000000UL                                 /**< Default value for MVP_CFG                   */
#define _MVP_CFG_MASK                                   0x00FF000FUL                                 /**< Mask for MVP_CFG                            */
#define MVP_CFG_PERFCNTEN                               (0x1UL << 0)                                 /**< Performance Counter Enable                  */
#define _MVP_CFG_PERFCNTEN_SHIFT                        0                                            /**< Shift value for MVP_PERFCNTEN               */
#define _MVP_CFG_PERFCNTEN_MASK                         0x1UL                                        /**< Bit mask for MVP_PERFCNTEN                  */
#define _MVP_CFG_PERFCNTEN_DEFAULT                      0x00000000UL                                 /**< Mode DEFAULT for MVP_CFG                    */
#define MVP_CFG_PERFCNTEN_DEFAULT                       (_MVP_CFG_PERFCNTEN_DEFAULT << 0)            /**< Shifted mode DEFAULT for MVP_CFG            */
#define MVP_CFG_OUTCOMPRESSDIS                          (0x1UL << 1)                                 /**< ALU Output Stream Compression Disable       */
#define _MVP_CFG_OUTCOMPRESSDIS_SHIFT                   1                                            /**< Shift value for MVP_OUTCOMPRESSDIS          */
#define _MVP_CFG_OUTCOMPRESSDIS_MASK                    0x2UL                                        /**< Bit mask for MVP_OUTCOMPRESSDIS             */
#define _MVP_CFG_OUTCOMPRESSDIS_DEFAULT                 0x00000000UL                                 /**< Mode DEFAULT for MVP_CFG                    */
#define MVP_CFG_OUTCOMPRESSDIS_DEFAULT                  (_MVP_CFG_OUTCOMPRESSDIS_DEFAULT << 1)       /**< Shifted mode DEFAULT for MVP_CFG            */
#define MVP_CFG_INCACHEDIS                              (0x1UL << 2)                                 /**< ALU Input Word Cache Disable                */
#define _MVP_CFG_INCACHEDIS_SHIFT                       2                                            /**< Shift value for MVP_INCACHEDIS              */
#define _MVP_CFG_INCACHEDIS_MASK                        0x4UL                                        /**< Bit mask for MVP_INCACHEDIS                 */
#define _MVP_CFG_INCACHEDIS_DEFAULT                     0x00000000UL                                 /**< Mode DEFAULT for MVP_CFG                    */
#define MVP_CFG_INCACHEDIS_DEFAULT                      (_MVP_CFG_INCACHEDIS_DEFAULT << 2)           /**< Shifted mode DEFAULT for MVP_CFG            */
#define MVP_CFG_LOOPERRHALTDIS                          (0x1UL << 3)                                 /**< Loop Error Halt Disable                     */
#define _MVP_CFG_LOOPERRHALTDIS_SHIFT                   3                                            /**< Shift value for MVP_LOOPERRHALTDIS          */
#define _MVP_CFG_LOOPERRHALTDIS_MASK                    0x8UL                                        /**< Bit mask for MVP_LOOPERRHALTDIS             */
#define _MVP_CFG_LOOPERRHALTDIS_DEFAULT                 0x00000000UL                                 /**< Mode DEFAULT for MVP_CFG                    */
#define MVP_CFG_LOOPERRHALTDIS_DEFAULT                  (_MVP_CFG_LOOPERRHALTDIS_DEFAULT << 3)       /**< Shifted mode DEFAULT for MVP_CFG            */
#define _MVP_CFG_PERF0CNTSEL_SHIFT                      16                                           /**< Shift value for MVP_PERF0CNTSEL             */
#define _MVP_CFG_PERF0CNTSEL_MASK                       0xF0000UL                                    /**< Bit mask for MVP_PERF0CNTSEL                */
#define _MVP_CFG_PERF0CNTSEL_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MVP_CFG                    */
#define _MVP_CFG_PERF0CNTSEL_RUN                        0x00000000UL                                 /**< Mode RUN for MVP_CFG                        */
#define _MVP_CFG_PERF0CNTSEL_CMD                        0x00000001UL                                 /**< Mode CMD for MVP_CFG                        */
#define _MVP_CFG_PERF0CNTSEL_STALL                      0x00000002UL                                 /**< Mode STALL for MVP_CFG                      */
#define _MVP_CFG_PERF0CNTSEL_NOOP                       0x00000003UL                                 /**< Mode NOOP for MVP_CFG                       */
#define _MVP_CFG_PERF0CNTSEL_ALUACTIVE                  0x00000004UL                                 /**< Mode ALUACTIVE for MVP_CFG                  */
#define _MVP_CFG_PERF0CNTSEL_PIPESTALL                  0x00000005UL                                 /**< Mode PIPESTALL for MVP_CFG                  */
#define _MVP_CFG_PERF0CNTSEL_IOFENCESTALL               0x00000006UL                                 /**< Mode IOFENCESTALL for MVP_CFG               */
#define _MVP_CFG_PERF0CNTSEL_LOAD0STALL                 0x00000007UL                                 /**< Mode LOAD0STALL for MVP_CFG                 */
#define _MVP_CFG_PERF0CNTSEL_LOAD1STALL                 0x00000008UL                                 /**< Mode LOAD1STALL for MVP_CFG                 */
#define _MVP_CFG_PERF0CNTSEL_STORESTALL                 0x00000009UL                                 /**< Mode STORESTALL for MVP_CFG                 */
#define _MVP_CFG_PERF0CNTSEL_BUSSTALL                   0x0000000AUL                                 /**< Mode BUSSTALL for MVP_CFG                   */
#define _MVP_CFG_PERF0CNTSEL_LOAD0AHBSTALL              0x0000000BUL                                 /**< Mode LOAD0AHBSTALL for MVP_CFG              */
#define _MVP_CFG_PERF0CNTSEL_LOAD1AHBSTALL              0x0000000CUL                                 /**< Mode LOAD1AHBSTALL for MVP_CFG              */
#define _MVP_CFG_PERF0CNTSEL_LOAD0FENCESTALL            0x0000000DUL                                 /**< Mode LOAD0FENCESTALL for MVP_CFG            */
#define _MVP_CFG_PERF0CNTSEL_LOAD1FENCESTALL            0x0000000EUL                                 /**< Mode LOAD1FENCESTALL for MVP_CFG            */
#define MVP_CFG_PERF0CNTSEL_DEFAULT                     (_MVP_CFG_PERF0CNTSEL_DEFAULT << 16)         /**< Shifted mode DEFAULT for MVP_CFG            */
#define MVP_CFG_PERF0CNTSEL_RUN                         (_MVP_CFG_PERF0CNTSEL_RUN << 16)             /**< Shifted mode RUN for MVP_CFG                */
#define MVP_CFG_PERF0CNTSEL_CMD                         (_MVP_CFG_PERF0CNTSEL_CMD << 16)             /**< Shifted mode CMD for MVP_CFG                */
#define MVP_CFG_PERF0CNTSEL_STALL                       (_MVP_CFG_PERF0CNTSEL_STALL << 16)           /**< Shifted mode STALL for MVP_CFG              */
#define MVP_CFG_PERF0CNTSEL_NOOP                        (_MVP_CFG_PERF0CNTSEL_NOOP << 16)            /**< Shifted mode NOOP for MVP_CFG               */
#define MVP_CFG_PERF0CNTSEL_ALUACTIVE                   (_MVP_CFG_PERF0CNTSEL_ALUACTIVE << 16)       /**< Shifted mode ALUACTIVE for MVP_CFG          */
#define MVP_CFG_PERF0CNTSEL_PIPESTALL                   (_MVP_CFG_PERF0CNTSEL_PIPESTALL << 16)       /**< Shifted mode PIPESTALL for MVP_CFG          */
#define MVP_CFG_PERF0CNTSEL_IOFENCESTALL                (_MVP_CFG_PERF0CNTSEL_IOFENCESTALL << 16)    /**< Shifted mode IOFENCESTALL for MVP_CFG       */
#define MVP_CFG_PERF0CNTSEL_LOAD0STALL                  (_MVP_CFG_PERF0CNTSEL_LOAD0STALL << 16)      /**< Shifted mode LOAD0STALL for MVP_CFG         */
#define MVP_CFG_PERF0CNTSEL_LOAD1STALL                  (_MVP_CFG_PERF0CNTSEL_LOAD1STALL << 16)      /**< Shifted mode LOAD1STALL for MVP_CFG         */
#define MVP_CFG_PERF0CNTSEL_STORESTALL                  (_MVP_CFG_PERF0CNTSEL_STORESTALL << 16)      /**< Shifted mode STORESTALL for MVP_CFG         */
#define MVP_CFG_PERF0CNTSEL_BUSSTALL                    (_MVP_CFG_PERF0CNTSEL_BUSSTALL << 16)        /**< Shifted mode BUSSTALL for MVP_CFG           */
#define MVP_CFG_PERF0CNTSEL_LOAD0AHBSTALL               (_MVP_CFG_PERF0CNTSEL_LOAD0AHBSTALL << 16)   /**< Shifted mode LOAD0AHBSTALL for MVP_CFG      */
#define MVP_CFG_PERF0CNTSEL_LOAD1AHBSTALL               (_MVP_CFG_PERF0CNTSEL_LOAD1AHBSTALL << 16)   /**< Shifted mode LOAD1AHBSTALL for MVP_CFG      */
#define MVP_CFG_PERF0CNTSEL_LOAD0FENCESTALL             (_MVP_CFG_PERF0CNTSEL_LOAD0FENCESTALL << 16) /**< Shifted mode LOAD0FENCESTALL for MVP_CFG    */
#define MVP_CFG_PERF0CNTSEL_LOAD1FENCESTALL             (_MVP_CFG_PERF0CNTSEL_LOAD1FENCESTALL << 16) /**< Shifted mode LOAD1FENCESTALL for MVP_CFG    */
#define _MVP_CFG_PERF1CNTSEL_SHIFT                      20                                           /**< Shift value for MVP_PERF1CNTSEL             */
#define _MVP_CFG_PERF1CNTSEL_MASK                       0xF00000UL                                   /**< Bit mask for MVP_PERF1CNTSEL                */
#define _MVP_CFG_PERF1CNTSEL_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MVP_CFG                    */
#define _MVP_CFG_PERF1CNTSEL_RUN                        0x00000000UL                                 /**< Mode RUN for MVP_CFG                        */
#define _MVP_CFG_PERF1CNTSEL_CMD                        0x00000001UL                                 /**< Mode CMD for MVP_CFG                        */
#define _MVP_CFG_PERF1CNTSEL_STALL                      0x00000002UL                                 /**< Mode STALL for MVP_CFG                      */
#define _MVP_CFG_PERF1CNTSEL_NOOP                       0x00000003UL                                 /**< Mode NOOP for MVP_CFG                       */
#define _MVP_CFG_PERF1CNTSEL_ALUACTIVE                  0x00000004UL                                 /**< Mode ALUACTIVE for MVP_CFG                  */
#define _MVP_CFG_PERF1CNTSEL_PIPESTALL                  0x00000005UL                                 /**< Mode PIPESTALL for MVP_CFG                  */
#define _MVP_CFG_PERF1CNTSEL_IOFENCESTALL               0x00000006UL                                 /**< Mode IOFENCESTALL for MVP_CFG               */
#define _MVP_CFG_PERF1CNTSEL_LOAD0STALL                 0x00000007UL                                 /**< Mode LOAD0STALL for MVP_CFG                 */
#define _MVP_CFG_PERF1CNTSEL_LOAD1STALL                 0x00000008UL                                 /**< Mode LOAD1STALL for MVP_CFG                 */
#define _MVP_CFG_PERF1CNTSEL_STORESTALL                 0x00000009UL                                 /**< Mode STORESTALL for MVP_CFG                 */
#define _MVP_CFG_PERF1CNTSEL_BUSSTALL                   0x0000000AUL                                 /**< Mode BUSSTALL for MVP_CFG                   */
#define _MVP_CFG_PERF1CNTSEL_LOAD0AHBSTALL              0x0000000BUL                                 /**< Mode LOAD0AHBSTALL for MVP_CFG              */
#define _MVP_CFG_PERF1CNTSEL_LOAD1AHBSTALL              0x0000000CUL                                 /**< Mode LOAD1AHBSTALL for MVP_CFG              */
#define _MVP_CFG_PERF1CNTSEL_LOAD0FENCESTALL            0x0000000DUL                                 /**< Mode LOAD0FENCESTALL for MVP_CFG            */
#define _MVP_CFG_PERF1CNTSEL_LOAD1FENCESTALL            0x0000000EUL                                 /**< Mode LOAD1FENCESTALL for MVP_CFG            */
#define MVP_CFG_PERF1CNTSEL_DEFAULT                     (_MVP_CFG_PERF1CNTSEL_DEFAULT << 20)         /**< Shifted mode DEFAULT for MVP_CFG            */
#define MVP_CFG_PERF1CNTSEL_RUN                         (_MVP_CFG_PERF1CNTSEL_RUN << 20)             /**< Shifted mode RUN for MVP_CFG                */
#define MVP_CFG_PERF1CNTSEL_CMD                         (_MVP_CFG_PERF1CNTSEL_CMD << 20)             /**< Shifted mode CMD for MVP_CFG                */
#define MVP_CFG_PERF1CNTSEL_STALL                       (_MVP_CFG_PERF1CNTSEL_STALL << 20)           /**< Shifted mode STALL for MVP_CFG              */
#define MVP_CFG_PERF1CNTSEL_NOOP                        (_MVP_CFG_PERF1CNTSEL_NOOP << 20)            /**< Shifted mode NOOP for MVP_CFG               */
#define MVP_CFG_PERF1CNTSEL_ALUACTIVE                   (_MVP_CFG_PERF1CNTSEL_ALUACTIVE << 20)       /**< Shifted mode ALUACTIVE for MVP_CFG          */
#define MVP_CFG_PERF1CNTSEL_PIPESTALL                   (_MVP_CFG_PERF1CNTSEL_PIPESTALL << 20)       /**< Shifted mode PIPESTALL for MVP_CFG          */
#define MVP_CFG_PERF1CNTSEL_IOFENCESTALL                (_MVP_CFG_PERF1CNTSEL_IOFENCESTALL << 20)    /**< Shifted mode IOFENCESTALL for MVP_CFG       */
#define MVP_CFG_PERF1CNTSEL_LOAD0STALL                  (_MVP_CFG_PERF1CNTSEL_LOAD0STALL << 20)      /**< Shifted mode LOAD0STALL for MVP_CFG         */
#define MVP_CFG_PERF1CNTSEL_LOAD1STALL                  (_MVP_CFG_PERF1CNTSEL_LOAD1STALL << 20)      /**< Shifted mode LOAD1STALL for MVP_CFG         */
#define MVP_CFG_PERF1CNTSEL_STORESTALL                  (_MVP_CFG_PERF1CNTSEL_STORESTALL << 20)      /**< Shifted mode STORESTALL for MVP_CFG         */
#define MVP_CFG_PERF1CNTSEL_BUSSTALL                    (_MVP_CFG_PERF1CNTSEL_BUSSTALL << 20)        /**< Shifted mode BUSSTALL for MVP_CFG           */
#define MVP_CFG_PERF1CNTSEL_LOAD0AHBSTALL               (_MVP_CFG_PERF1CNTSEL_LOAD0AHBSTALL << 20)   /**< Shifted mode LOAD0AHBSTALL for MVP_CFG      */
#define MVP_CFG_PERF1CNTSEL_LOAD1AHBSTALL               (_MVP_CFG_PERF1CNTSEL_LOAD1AHBSTALL << 20)   /**< Shifted mode LOAD1AHBSTALL for MVP_CFG      */
#define MVP_CFG_PERF1CNTSEL_LOAD0FENCESTALL             (_MVP_CFG_PERF1CNTSEL_LOAD0FENCESTALL << 20) /**< Shifted mode LOAD0FENCESTALL for MVP_CFG    */
#define MVP_CFG_PERF1CNTSEL_LOAD1FENCESTALL             (_MVP_CFG_PERF1CNTSEL_LOAD1FENCESTALL << 20) /**< Shifted mode LOAD1FENCESTALL for MVP_CFG    */

/* Bit fields for MVP STATUS */
#define _MVP_STATUS_RESETVALUE                          0x00000004UL                       /**< Default value for MVP_STATUS                */
#define _MVP_STATUS_MASK                                0x00000007UL                       /**< Mask for MVP_STATUS                         */
#define MVP_STATUS_RUNNING                              (0x1UL << 0)                       /**< Running Status                              */
#define _MVP_STATUS_RUNNING_SHIFT                       0                                  /**< Shift value for MVP_RUNNING                 */
#define _MVP_STATUS_RUNNING_MASK                        0x1UL                              /**< Bit mask for MVP_RUNNING                    */
#define _MVP_STATUS_RUNNING_DEFAULT                     0x00000000UL                       /**< Mode DEFAULT for MVP_STATUS                 */
#define MVP_STATUS_RUNNING_DEFAULT                      (_MVP_STATUS_RUNNING_DEFAULT << 0) /**< Shifted mode DEFAULT for MVP_STATUS         */
#define MVP_STATUS_PAUSED                               (0x1UL << 1)                       /**< Paused Status                               */
#define _MVP_STATUS_PAUSED_SHIFT                        1                                  /**< Shift value for MVP_PAUSED                  */
#define _MVP_STATUS_PAUSED_MASK                         0x2UL                              /**< Bit mask for MVP_PAUSED                     */
#define _MVP_STATUS_PAUSED_DEFAULT                      0x00000000UL                       /**< Mode DEFAULT for MVP_STATUS                 */
#define MVP_STATUS_PAUSED_DEFAULT                       (_MVP_STATUS_PAUSED_DEFAULT << 1)  /**< Shifted mode DEFAULT for MVP_STATUS         */
#define MVP_STATUS_IDLE                                 (0x1UL << 2)                       /**< Idle Status                                 */
#define _MVP_STATUS_IDLE_SHIFT                          2                                  /**< Shift value for MVP_IDLE                    */
#define _MVP_STATUS_IDLE_MASK                           0x4UL                              /**< Bit mask for MVP_IDLE                       */
#define _MVP_STATUS_IDLE_DEFAULT                        0x00000001UL                       /**< Mode DEFAULT for MVP_STATUS                 */
#define MVP_STATUS_IDLE_DEFAULT                         (_MVP_STATUS_IDLE_DEFAULT << 2)    /**< Shifted mode DEFAULT for MVP_STATUS         */

/* Bit fields for MVP PERFCNT */
#define _MVP_PERFCNT_RESETVALUE                         0x00000000UL                      /**< Default value for MVP_PERFCNT               */
#define _MVP_PERFCNT_MASK                               0x00FFFFFFUL                      /**< Mask for MVP_PERFCNT                        */
#define _MVP_PERFCNT_COUNT_SHIFT                        0                                 /**< Shift value for MVP_COUNT                   */
#define _MVP_PERFCNT_COUNT_MASK                         0xFFFFFFUL                        /**< Bit mask for MVP_COUNT                      */
#define _MVP_PERFCNT_COUNT_DEFAULT                      0x00000000UL                      /**< Mode DEFAULT for MVP_PERFCNT                */
#define MVP_PERFCNT_COUNT_DEFAULT                       (_MVP_PERFCNT_COUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for MVP_PERFCNT        */

